* BOOST 36V 3A CON MICRO stm32f030K6T6
** Principio de funcionamiento
   - Funcionan con 2 mosfets sincronizados TIM1 -> TIM3
   - CTRL_Q2 (PA8 TIM1 CH1)
   - CTRL_Q1 (PA6 TIM3 CH1)
   - Ademas uso el LED en (PA10 TIM1 CH3) si selecciono USE_LED_AS_TIM1_CH3

** Terminar en el firmware [1/4]
   - [ ] Corregir configuracion de INT
   - [ ] Activar bien INT
   - [X] Revisar signals pwm en synchro
   - [ ] ADC synchro con pwm tim1 o tim3
   
** Arranque Hardware
*** ADC + DMA + TIM
**** Tiempo teorico de conversion ADC con DMA
     - tiempo de conversion por canal 12bits (sample_time + 12.5) * tick
     - tiempo de conversion por canal 10bits (sample_time + 10.5) * tick
     - tiempo de conversion por canal 8bits (sample_time + 8.5) * tick

       | Resolution | Sample Time[samples] | Channels | Clk Freq [MHz] | Time to end [us] |
       |------------+----------------------+----------+----------------+------------------|
       |         10 |                 71.5 |        5 |             12 |        34.166667 |
       |            |                      |          |                |                  |
       #+TBLFM: @2$5=((@2$1+0.5+@2$2)*@2$3/@2$4)

**** Tiempo teorico de toma de resultados
     - Los resultados (valores ADC) no los tomo justo en el tiempo de conversion,
       sino como multiplo del timer que dispara las conversiones
     - Este tiempo "real" de muestreo es el minimo multiplo del timer que supera al 
       tiempo del ADC
     
     - min(Ttim * n) > Tadc

    | freq TIM3 | Ttim[us] | Tadc [us] | Multiplo | T seq_ready [us] | F seq_ready [KHz] |
    |-----------+----------+-----------+----------+------------------+-------------------|
    | 48KHz     |    20.83 |     34.16 |        2 |            41.66 |         24.003841 |
    | 70KHz     |    14.28 |     34.16 |        3 |            42.84 |         23.342670 |
    |           |          |           |          |                  |                   |
    #+TBLFM: @2$6=1000/@2$5::@3$5=(@3$2*@3$4)::@2$5=(@2$2*@2$4)

**** Medicion de tiempo del DMA para el ADC
    - con 70KHz en TIM3 termina justo en la mitad de un ciclo
    - con 48KHz en TIM3 termina 1/3 antes del nuevo pulso

    | freq TIM3 | freq seq_ready | T end of conversion |
    |-----------+----------------+---------------------|
    | 48KHz     | 24.0KHz        | 41.6us              |
    | 70KHz     | 23.6KHz        | 42.4us              |
    |           |                |                     |

*** TODO Revisar sensado de corriente - parece no funcionar ok -
    - mueve la corriente cuando se calienta, parece ser el opto o algo combinado con el opto

*** TODO Arranque del micro desde 220Vac
    - no funciona todavia, consume demasiado y no logra cargar el C del bias "C18"

*** TODO Se mueve un poco la corriente de salida
    - es medio inestable, poco, y se notan pequeños parpadeos en el LED
    - probablemente ruido en el PID

*** No sirve para dimmerizar con TRIAC
    - no por el d100w, sino que cuando el dimmer corta el ciclo comienza con errores
      de disparo en el TRIAC y ruidos extraños


* Mediciones 24-12-19
** Generacion senial senoidal
   - con pwm 3.3V desde el micro y comp compensado con preset consigo:
     senoidal rectificada de 1.4V a 4.1V delta: 2.76V

** Salida para desconexion
   - mandar 3.3V al pwm para apagar

** Sensado de tension V

   | VPOS  | Vup (R30) |
   |-------+-----------|
   | 34.8V | 1.68V     |
   | 30V   | 1.4V      |
   | 24V   | 0.88V     |

** Sensado de corriente Rsense

   | IOUT  | Iup (R17) |
   |-------+-----------|
   | 2.38A | 1.56V     |

** Sensado de 220Vac - V220_sense

   | Vin acrms | V220_sense | Comments.                                |
   |-----------+------------+------------------------------------------|
   | 220Vac    | 2.52V 50Hz | mucho ruido, es una senoidal rectificada |
   |           |            |                                          |

** Isense del mosfet
   - 4 R 1ohm SMD en //

   | Salida    | V(I_sense)                                |
   |-----------+-------------------------------------------|
   | 30V 2.38A | 260mV; 480mV (trapecio); Ton 6us T 15.6us |
   
** Tiempo de vuelta Voltage Mode - 30-7-19
   - tiempo de proceso luego de sequence_ready (boost mode): 
     sin generar tipico 5.04us, cada tanto 6.96us
     generando tipico 7.6us 11.8us cada tanto

   - las secuencias largas debe ser por el modo undersampling
